## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 5 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.rds.aws_rds_cluster_instance.instances[0] will be created
  + resource "aws_rds_cluster_instance" "instances" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = (known after apply)
      + cluster_identifier              = "scan-websites-cluster"
      + copy_tags_to_snapshot           = false
      + db_parameter_group_name         = (known after apply)
      + db_subnet_group_name            = "scan-websites-subnet-group"
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_version                  = "11.9"
      + engine_version_actual           = (known after apply)
      + id                              = (known after apply)
      + identifier                      = "scan-websites-instance-0"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.t3.medium"
      + kms_key_id                      = (known after apply)
      + monitoring_interval             = 0
      + monitoring_role_arn             = (known after apply)
      + performance_insights_enabled    = true
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + promotion_tier                  = 0
      + publicly_accessible             = false
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "CostCentre" = "scan-websites-production"
          + "Name"       = "scan-websites-instance-0"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre" = "scan-websites-production"
          + "Name"       = "scan-websites-instance-0"
          + "Terraform"  = "true"
        }
      + writer                          = (known after apply)
    }

  # module.rds.aws_security_group.rds_to_proxy must be replaced
+/- resource "aws_security_group" "rds_to_proxy" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:507252742351:security-group/sg-09e576ac38619f252" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-09e576ac38619f252" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "terraform-20210731003115886600000001" -> "scan-websites_rds_proxy_sg" # forces replacement
      ~ name_prefix            = "terraform-" -> (known after apply)
      ~ owner_id               = "507252742351" -> (known after apply)
        tags                   = {
            "CostCentre" = "scan-websites-production"
            "Name"       = "scan-websites_rds_proxy_sg"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_default_network_acl.default will be updated in-place
  ~ resource "aws_default_network_acl" "default" {
        id                     = "acl-01071a2f34fe3944b"
      ~ subnet_ids             = [
          - "subnet-0270b18ad41a9772d",
          - "subnet-0a137f92388e6a7bf",
          - "subnet-0a6cc6f7730f2034c",
          - "subnet-0c3abcc29d00b8589",
          - "subnet-0d16dd34a0f0a4589",
          - "subnet-0e48adc704a15a982",
        ]
        tags                   = {
            "CostCentre" = "scan-websites-production"
            "Name"       = "scan-websites_default_nacl"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_network_acl.main will be created
  + resource "aws_network_acl" "main" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = [
          + "subnet-0270b18ad41a9772d",
          + "subnet-0a137f92388e6a7bf",
          + "subnet-0a6cc6f7730f2034c",
          + "subnet-0c3abcc29d00b8589",
          + "subnet-0d16dd34a0f0a4589",
          + "subnet-0e48adc704a15a982",
        ]
      + tags       = {
          + "CostCentre" = "scan-websites-production"
          + "Name"       = "scan-websites_main_nacl"
          + "Terraform"  = "true"
        }
      + tags_all   = {
          + "CostCentre" = "scan-websites-production"
          + "Name"       = "scan-websites_main_nacl"
          + "Terraform"  = "true"
        }
      + vpc_id     = "vpc-095a761b6add80a7b"
    }

  # module.vpc.aws_network_acl_rule.block_rdp[0] will be created
  + resource "aws_network_acl_rule" "block_rdp" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + from_port      = 3389
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "deny"
      + rule_number    = 51
      + to_port        = 3389
    }

  # module.vpc.aws_network_acl_rule.block_ssh[0] will be created
  + resource "aws_network_acl_rule" "block_ssh" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + from_port      = 22
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "deny"
      + rule_number    = 50
      + to_port        = 22
    }

Plan: 5 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>